package knowledge.数据结构;

/**
 * Hash 散列函数
 * 一般翻译做散列、杂凑，或音译为哈希，是把任意长度的输入（又叫做预映射pre-image）通过散列算法变换成固定长度的输出，该输出就是散列值。
 * 这种转换是一种压缩映射，也就是，散列值的空间通常远小于输入的空间，不同的输入可能会散列成相同的输出，所以不可能从散列值来确定唯一的输入值。
 * 简单的说就是一种将任意长度的消息压缩到某一固定长度的消息摘要的函数。
 * <p>
 * 常见的哈希函数：
 * 1.直接定址法
 * 2.除留余数法
 * 3.数字分析法
 * 4.平均取中法
 * 5.折叠法（叠加法）
 * 6.随机数法
 * <p>
 * 解决哈希冲突的方法：
 * 1.链接法（拉链法）
 * 2.开放定址法
 * <p>
 * https://blog.csdn.net/u012426327/article/details/77504188
 *
 * @author ljh
 * created on 2020/10/19 17:28
 */
public class Hash {
}
